{
    "metadata": {
        "total_size": 134128152.0
    },
    "weight_map": {
        "/layers/conv2d/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_1/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_1/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_2/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_2/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_3/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_3/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_4/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_4/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_5/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_5/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_6/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_7/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_6/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_7/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_8/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_8/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_9/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_9/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_10/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_10/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_11/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_12/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_11/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_12/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_13/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_13/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_14/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_14/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_15/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_15/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_16/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_17/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_16/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_17/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_18/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_18/vars": "ResNet18_00000.weights.h5",
        "/layers/conv2d_19/vars": "ResNet18_00000.weights.h5",
        "/layers/batch_normalization_19/vars": "ResNet18_00000.weights.h5",
        "/layers/dense/vars": "ResNet18_00000.weights.h5",
        "/optimizer/vars": "ResNet18_00000.weights.h5"
    }
}